In [17]:
import numpy as np
import pandas as pd

In [57]:
# 1 - a
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic['category1'] = titanic.apply(lambda x : 'child' if x.age < 20 else x.sex, axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

In [115]:
# 1 - b
titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,gen,threegen
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년,young
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,old
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,middle
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,old
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년,old
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년,middle
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,young
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,청년,middle
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,middle
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,old

In [33]:
# 1 - c
titanic.survived.groupby([titanic.sex, titanic['class'], titanic.embark_town]).mean()

sex     class   embark_town
female  First   Cherbourg      0.976744
                Queenstown     1.000000
                Southampton    0.958333
        Second  Cherbourg      1.000000
                Queenstown     1.000000
                Southampton    0.910448
        Third   Cherbourg      0.652174
                Queenstown     0.727273
                Southampton    0.375000
male    First   Cherbourg      0.404762
                Queenstown     0.000000
                Southampton    0.354430
        Second  Cherbourg      0.200000
                Queenstown     0.000000
                Southampton    0.154639
        Third   Cherbourg      0.232558
                Queenstown     0.076923
                Southampton    0.128302
Name: survived, dtype: float64

In [59]:
# 1 - d
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic['gen'] = pd.cut(titanic.age, bins, labels=labels)
underage = titanic[titanic.gen == '미성년자'].gen.count() / titanic.gen.count()
youth = titanic[titanic.gen == '청년'].gen.count() / titanic.gen.count()
middleage = titanic[titanic.gen == '중년'].gen.count() / titanic.gen.count()
elder = titanic[titanic.gen == '장년'].gen.count() / titanic.gen.count()
grand = titanic[titanic.gen == '노년'].gen.count() / titanic.gen.count()
underage + youth + middleage + elder + grand

1.0

In [71]:
# 1- e
titanic['threegen'] = pd.qcut(titanic.age, q = 3, labels = ['young','middle','old'])
titanic.survived.groupby([titanic.threegen, titanic.sex]).mean()

threegen  sex
young     female    0.713115
          male      0.206704
middle    female    0.701031
          male      0.164251
old       female    0.821053
          male      0.198953
Name: survived, dtype: float64

In [76]:
# 2 - a
mpg = sns.load_dataset('mpg')
mpg['hp_per_cc'] = mpg.apply(lambda x : x.horsepower / x.displacement, axis = 1)

In [88]:
# 2- b
mpg['manufacturer'] = mpg.name.str.split(' ').str[0]
mpg['model'] = mpg.name.str.split(' ').str[1:]
mpg.drop('name', axis = 1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,"[chevelle, malibu]"
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,"[skylark, 320]"
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,[satellite]
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,"[rebel, sst]"
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,[torino]
...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,0.614286,ford,"[mustang, gl]"
394,44.0,4,97.0,52.0,2130,24.6,82,europe,0.536082,vw,[pickup]
395,32.0,4,135.0,84.0,2295,11.6,82,usa,0.622222,dodge,[rampage]
396,28.0,4,120.0,79.0,2625,18.6,82,usa,0.658333,ford,[ranger]
397,31.0,4,119.0,82.0,2720,19.4,82,usa,0.689076,chevy,[s-10]

In [89]:
# 2 - c
mpg.mpg.groupby(mpg.cylinders).mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [90]:
# 2 - d
mpg.hp_per_cc.groupby(mpg.origin).mean()

origin
europe    0.740005
japan     0.789485
usa       0.512063
Name: hp_per_cc, dtype: float64

In [116]:
# 2 -e 
mpg.mpg.groupby([i for i in mpg.manufacturer if mpg.model.count() >= 5])\
    .mean().sort_values(ascending = False).head(5)

vw         39.016667
nissan     36.000000
triumph    35.000000
honda      33.761538
renault    32.880000
Name: mpg, dtype: float64